@echo off

rem Автор скрипта: dolphin_korkino@mail.ru
rem Версия скрипта: 31 августа 2015

set a4=0
set a24=0
set a116=0
set a117=0
set a119=0
set a190=0

:a94
chcp WINDOWS-1251>nul

rem ####################################################################################################

rem Активировать настройки скрипта (0 - нет, 1 - да).
set a69=0

rem ####################################################################################################

rem Автозапуск скрипта при включении компьютера (0 - выкл., 1 - вкл.).
set a206=0

rem Автоматически закрыть скрипт по завершении сканирования (0 - выкл., 1 - вкл.).
set a121=0

rem ####################################################################################################

rem Номер диапазона сканирования IP-адресов, который доступен в опциях "Параметры сканирования" (с 1 по 10).
set a100=1

rem ####################################################################################################

rem Cканировать свои диапазоны IP-адресов (0 - выкл., 1 - вкл.). Если функция включена, то диапазоны, доступные в опциях "Параметры сканирования" будут проигнорированы.
set a97=0

rem Укажите свои диапазоны IP-адресов. Пример: 176.51.0.0 - 176.51.99.255 :1234.
set b1=
set b2=
set b3=
set b4=
set b5=
set b6=
set b7=
set b8=
set b9=
set b10=
set b11=
set b12=
set b13=
set b14=
set b15=
set b16=
set b17=
set b18=
set b19=
set b20=

rem ####################################################################################################

rem Использовать свой плейлист (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Сканировать свои диапазоны IP-адресов". Если функция включена, то скрипт не будет создавать плейлисты "SimpleTV" и "VLC".
set a183=0

rem Укажите имя Вашего плейлиста. Пример: Playlist.m3u. Плейлист должен находиться в папке со скриптом. В имени плейлиста не должно быть пробелов.
set a175=

rem Укажите IP-адрес и порт прокси-сервера, который указан в Вашем плейлисте. Пример: 176.51.0.0:1234.
set a176=

rem ####################################################################################################

rem Многопоточное сканирование (0 - выкл., 1 - вкл.). Скрипт, вместо сканера tcping.exe будет использовать сканер vnc.exe. Как его использовать смотрите в файле Информация.txt.
set a456=0

rem Количество потоков сканирования (по умолчанию: 256). Не рекомендуется указывать большое количество потоков, так как есть вероятность пропуска рабочих серверов.
set a457=256

rem ####################################################################################################

rem Проверка списка IP-адресов из текстового файла (0 - выкл., 1 - вкл.). Эта функция используется для проверки списка IP-адресов из текстового файла, отсканированных другим сканером. Если функция включена, то не нужно указывать свои диапазоны IP-адресов.
set a369=0

rem Укажите имя текстового файла для проверки списка IP-адресов. Пример: Scanner.txt. Файл должен находиться в папке со скриптом.
set a370=

rem ####################################################################################################

rem Совместная работа нескольких скриптов (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Использовать свой плейлист". Эта функция используется для совместной работы нескольких скриптов, которые используют один плейлист, составленный из нескольких провайдеров.
set a339=0

rem ####################################################################################################

rem Искать только прокси-сервера "udpxy" (0 - выкл., 1 - вкл.).
set a193=1

rem ####################################################################################################

rem Искать свободный сервер (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Искать только прокси-сервера "udpxy"".
set a123=0

rem Мониторинг свободного сервера (0 - выкл., 1 - вкл.). Эта функция приостанавливает сканирование, когда найден свободный сервер. Скрипт мониторит сервер до тех пор, пока сервер работает и свободен. Потом сканирование продолжается с места остановки.
set a264=0

rem Максимальное количество клиентов на сервере (0 - искать свободный сервер). Этот метод имеет погрешность, поэтому не рекомендуется указывать "0", если хотите найти свободный сервер.
set a319=1

rem ####################################################################################################

rem Проверять вещание каналов на сервере (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Искать только прокси-сервера "udpxy"".
set a125=0

rem Укажите IP-адрес и порт канала для проверки вещания каналов на сервере. Пример: 233.7.70.128:5000.
set a182=

rem ####################################################################################################

rem Поиск каналов на сервере (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Проверять вещание каналов на сервере". Скрипт ищет рабочий сервер и производит поиск каналов на этом сервере. Найденные каналы скрипт запишет в плейлист и завершит сканирование.
set a292=0

rem Укажите диапазон IP-адресов и порт для поиска каналов на сервере. Пример: 233.7.70.0 - 233.7.70.255 :5000.
set a307=

rem Искать каналы, которых нет в Вашем плейлисте (0 - выкл., 1 - вкл.). Эта функция работает, только если включена функция "Использовать свой плейлист".
set a316=0

rem ####################################################################################################

rem Циклический запуск сканирования через указанное время. Пример: 00:00 - функция выключена, 02:30 - запускать сканирование через каждые 2 часа 30 минут, 24:00 - максимальное значение.
set a209=00:00

rem Сбрасывать счётчик количества созданных плейлистов (%a4%) при циклическом сканировании (0 - выкл., 1 - вкл.).
set a276=1

rem ####################################################################################################

rem Задержка ожидания ответа от сервера (0.05 - 50 мс, 0.1 - 100 мс, 1 - 1 сек).
set a21=0.5

rem ####################################################################################################

rem Ограничение на количество создаваемых плейлистов (0 - выкл.).
set a85=0

rem ####################################################################################################

rem Создавать плейлисты "SimpleTV" (0 - нет, 1 - да).
set a10=1

rem Создавать плейлисты "VLC" (0 - нет, 1 - да).
set a70=1

rem ####################################################################################################

rem Создавать файлы "Статистика" для каждого плейлиста (0 - нет, 1 - да).
set a71=0

rem Создавать файл "Статистика" для всех плейлистов (0 - нет, 1 - да).
set a143=1

rem ####################################################################################################

rem Создавать лог файл "Статистика" (0 - нет, 1 - да).
set a163=0

rem Дописывать в лог файл "Статистика" (0 - нет, 1 - да).
set a243=0

rem ####################################################################################################

rem Закачивать файлы на FTP (0 - выкл., 1 - вкл.).
set a201=0

rem Укажите полный путь к папке на FTP. Пример: ftp://ucoz.ru/playlist/. Файлы при совпадении имён будут перезаписываться.
set a205=

rem Укажите логин от FTP.
set a203=

rem Укажите пароль от FTP.
set a204=

rem ####################################################################################################

rem Очищать папку "Плейлисты" перед каждым сканированием (0 - нет, 1 - да). Если функция выключена, то файлы при совпадении имён будут перезаписываться.
set a107=1

rem ####################################################################################################

rem Имя папки "Плейлисты". При необходимости можно изменить расположение папки. Пример: C:\Плейлисты\. Внимание! Если включена функция "Очищать папку "Плейлисты" перед каждым сканированием", то скрипт очистит указанную папку.
set a26=Плейлисты

rem ####################################################################################################

rem Имя временного файла ".temp". Скрипт во время работы создаёт временной файл со случайным именем. При необходимости можно изменить имя временного файла, чтобы избежать ошибок при одновременной работе нескольких скриптов. Пример: scanner.temp. В имени файла не должно быть пробелов.
set a202=

rem ####################################################################################################

:a114
chcp 1251>nul

rem Изменять имена файлов (0 - нет, 1 - да). (%a4% - это счётчик, его можно перемещать в начало или в конец имени файла).
set a113=0

rem Имя Вашего плейлиста. Пример: первый плейлист будет создан с именем IPTV_1.m3u, второй - с именем IPTV_2.m3u и т.д.
set a187=IPTV_%a4%.m3u

rem Имя плейлиста "SimpleTV". Пример: первый плейлист будет создан с именем IPTV_1_S.m3u, второй - с именем IPTV_2_S.m3u и т.д.
set a86=IPTV_%a4%_S.m3u

rem Имя плейлиста "VLC". Пример: первый плейлист будет создан с именем IPTV_1_V.m3u, второй - с именем IPTV_2_V.m3u и т.д.
set a87=IPTV_%a4%_V.m3u

rem Имя файла "Статистика", который создаётся для каждого плейлиста. Пример: первый файл будет создан с именем IPTV_1_P.html, второй - с именем IPTV_2_P.html и т.д.
set a112=IPTV_%a4%_P.html

rem Имя файла "Статистика", который создаётся один для всех плейлистов (%a4% - счётчик к этому файлу не применяется!).
set a147=Статистика.html

rem Имя лог файла "Статистика" (%a4% - счётчик к этому файлу не применяется!).
set a167=Статистика.log

rem ####################################################################################################

chcp 866>nul
if "%a190%"=="1" goto a191
if "%a116%"=="1" goto a115
if "%a117%"=="1" goto a118
if "%a119%"=="1" goto a120
if "%a24%"=="1" goto a48

chcp 1251>nul
set a3=Сканер IPTV
set a8=Сканируется диапазон IP-адресов
set a9=Найден сервер:
set a11=Выберите нужную опцию:
set a12=1 - Запустить сканирование
set a15=Неверная команда
set a25=Статистика
set a26=Плейлисты
set a29=2 - Параметры сканирования
set a31=Выберите задержку ожидания ответа от сервера:
set a32=1 - 50  мс
set a33=2 - 100 мс
set a34=3 - 200 мс
set a35=4 - 300 мс
set a36=5 - 400 мс
set a37=6 - 500 мс
set a47=Сканирование завершено
set a53=Выберите диапазон сканирования IP-адресов:
set a54=1  - 176.51.0.0  - 176.51.9.255  :1234
set a13=2  - 176.51.10.0 - 176.51.19.255 :1234
set a14=3  - 176.51.20.0 - 176.51.29.255 :1234
set a19=4  - 176.51.30.0 - 176.51.39.255 :1234
set a60=5  - 176.51.40.0 - 176.51.49.255 :1234
set a180=6  - 176.51.50.0 - 176.51.59.255 :1234
set a58=7  - 176.51.60.0 - 176.51.69.255 :1234
set a63=8  - 176.51.70.0 - 176.51.79.255 :1234
set a65=9  - 176.51.80.0 - 176.51.89.255 :1234
set a67=10 - 176.51.90.0 - 176.51.99.255 :1234
set a75=Вы не указали свои диапазоны сканирования IP-адресов
set a95=Создано плейлистов:
set a105=Неверные настройки скрипта
set a132=- сервер занят
set a133=- нет вещания каналов
set a134=- сервер работает
set a140=- ошибка проверки статистики сервера
set a141=- сервер свободен
set a148=Статистика.html
set a164=Статистика.log
set a185=Не удаётся найти плейлист
set a231=Проверка подключения к интернету...
set a226=Запуск сканирования через:
set a239=Проверьте подключение к интернету
set a241=Повторная попытка через 1 минуту...
set a272=- сервер свободен (мониторинг сервера)
set a289=Найдено серверов:
set a299=- поиск каналов
set a303=Найдено каналов:
set a298=Найден канал:
set a327=Вы не указали имя своего плейлиста
set a331=Вы не указали IP-адрес и порт прокси-сервера, который указан в Вашем плейлисте
set a334=Вы не указали IP-адрес и порт канала для проверки вещания каналов на сервере
set a337=Вы не указали диапазон IP-адресов и порт для поиска каналов на сервере
set a342=3 - Проверить обновления
set a346=Не удалось проверить наличие новой версии скрипта
set a350=Вы используете самую последнюю версию скрипта
set a351=Текущая версия:
set a352=Доступна новая версия скрипта
set a353=Последняя версия:
set a356=1 - Скачать новую версию
set a357=2 - Вернуться назад
set a363=Не удалось скачать новую версию скрипта
set a365=Новая версия скрипта успешно скачана
set a368=Файл скачан в папку:
set a375=Вы не указали имя текстового файла для проверки списка IP-адресов
set a377=Не удаётся найти файл
set a379=Проверяется список IP-адресов из файла
set a392=Проверка завершена
set a394=Проверено серверов:
set a398=Проверен сервер:
set a432=Скачивается новая версия скрипта...
set a474=Вы не указали количество потоков сканирования
set a228=Возникла непредвиденная ошибка в работе скрипта
chcp 866>nul

title %a3%

for %%a in (%0) do cd /d "%%~dpa"
for %%a in (%0) do set a210=%%~na

:a106
set a347=31.08.2015
set a291=%time:~9,11%
ping.exe /n 1 /w 1000 google.ru>nul
set a291=%time:~9,11%%a291%.temp
set a206=0
set a121=0
set a209=00:00
set a100=1
set a97=0
set a21=0.5
set a123=0
set a125=1
set a169=1
set a85=0
set a10=1
set a70=1
set a71=0
set a143=1
set a163=0
set a201=0
set a107=1
set a113=0
set a103=0
set a129=0
set a130=0
set a139=0
set a145=0
set a155=0
set a73=1234567890
set a79=.
set a174=
set a182=233.7.70.128:5000
set a183=0
set a193=1
set a233=0
set a242=0
set a243=0
set a264=0
set a276=1
set a4=0
set a292=0
set a137=1
set /a a320=%a319%+1
set a328=0
set a339=0
set a340=0
set a369=0
set a407=
set a414=
set a422=
set a312=0
set a456=0
set a460=0
set a476=0
set a477=0
goto a232

:a230
set /a a233=%a233%+1
if "%a233%"=="1" echo %a231%
if "%a233%"=="1" echo.
if "%a233%"=="10" goto a240
sleep.exe 10
goto a232

:a240
set a233=0
cls
echo %a239%
echo.
echo %a241%
echo.
sleep.exe 60
cls

:a232
ping.exe /n 1 /w 1000 google.ru>nul
if errorlevel 1 (goto a234) else (goto a229)

:a234
ping.exe /n 1 /w 1000 yandex.ru>nul
if errorlevel 1 (goto a230) else (goto a229)

:a229
if exist "%a291%" del /q %a291%
cls
if "%a69%"=="1" (goto a138) else (goto a22)

:a138
if "%a202%"=="" goto a428
set a291=%a202%

:a428
if "%a137%"=="1" goto a17

:a22
echo %a11%
echo.
echo %a12%
echo %a29%
echo %a342%
echo.

set /p a16=
cls
if "%a16%"=="1" goto a17
if "%a16%"=="2" goto a52
if "%a16%"=="3" goto a343
goto a20

:a343
if exist "%a291%" del /q %a291%
curl.exe -s -m 5 -o %a291% http://81.177.141.125/scanner.temp
if exist "%a291%" goto a344

:a429
if exist "%a291%" del /q %a291%
curl.exe -s -m 5 -o %a291% http://81.177.140.138/scanner.temp
if exist "%a291%" goto a430
goto a345

:a344
find "Сканер IPTV" %a291%>nul
if errorlevel 1 goto a429
goto a431

:a430
find "Сканер IPTV" %a291%>nul
if errorlevel 1 goto a345

:a431
for /f "skip=3" %%a in (%a291%) do set a366=%%a
for /f "skip=1" %%a in (%a291%) do (
set a348=%%a
goto a355
)

:a355
chcp 1251>nul
for /f "skip=2 delims=" %%a in (%a291%) do (
set a354=%%a
goto a367
)

:a367
chcp 866>nul
if exist "%a291%" del /q %a291%
if "%a347%"=="%a348%" goto a349

:a362
echo %a352%
echo.
echo %a353% %a354%
echo.
echo %a356%
echo %a357%
echo.
set /p a358=
cls
if "%a358%"=="1" goto a359
if "%a358%"=="2" goto a22
goto a361

:a359
echo %a432%
echo.
if exist "IPTV.rar" del /q IPTV.rar
curl.exe -s -m 300 -o IPTV.rar http://81.177.141.125/IPTV.rar
if exist "IPTV.rar" goto a360

:a433
if exist "IPTV.rar" del /q IPTV.rar
curl.exe -s -m 300 -o IPTV.rar http://81.177.140.138/IPTV.rar
if exist "IPTV.rar" goto a435
goto a364

:a360
for %%a in (IPTV.rar) do if not "%%~za"=="%a366%" goto a433
goto a434

:a435
for %%a in (IPTV.rar) do if not "%%~za"=="%a366%" goto a364

:a434
cls
echo %a365%
echo.
for %%a in (%0) do echo %a368% "%%~dpaIPTV.rar"
echo.
pause>nul
cls
goto a22

:a364
if exist "IPTV.rar" del /q IPTV.rar
cls
echo %a363%
echo.
pause>nul
cls
goto a22

:a361
echo %a15%
echo.
sleep.exe 3
cls
goto a362

:a345
if exist "%a291%" del /q %a291%
echo %a346%
echo.
pause>nul
cls
goto a22

:a349
echo %a350%
echo.
echo %a351% %a354%
echo.
pause>nul
cls
goto a22

:a17
set a27=176
set a28=51
set a1=0
set a2=-1
set a43=1234
set a44=10
set a45=256
set a76=176.51.0.0 - 176.51.9.255
goto a23

:a20
echo %a15%
echo.
sleep.exe 3
cls
goto a22

:a30
echo %a31%
echo.
echo %a32%
echo %a33%
echo %a34%
echo %a35%
echo %a36%
echo %a37%
echo.

set /p a38=
cls
if "%a38%"=="1" goto a39
if "%a38%"=="2" goto a49
if "%a38%"=="3" goto a40
if "%a38%"=="4" goto a50
if "%a38%"=="5" goto a41
if "%a38%"=="6" (goto a51) else (goto a42)

:a39
set a21=0.05
goto a84

:a49
set a21=0.1
goto a84

:a40
set a21=0.2
goto a84

:a50
set a21=0.3
goto a84

:a41
set a21=0.4
goto a84

:a51
set a21=0.5
goto a84

:a42
echo %a15%
echo.
sleep.exe 3
cls
goto a30

:a52
echo %a53%
echo.
echo %a54%
echo %a13%
echo %a14%
echo %a19%
echo %a60%
echo %a180%
echo %a58%
echo %a63%
echo %a65%
echo %a67%
echo.

set /p a55=
cls

:a101
if not "%a55%"=="1" goto a57
set a27=176
set a28=51
set a1=0
set a2=-1
set a43=1234
set a44=10
set a45=256
set a76=176.51.0.0 - 176.51.9.255
if "%a103%"=="1" goto a84
goto a30

:a57
if not "%a55%"=="2" goto a18
set a27=176
set a28=51
set a1=10
set a2=-1
set a43=1234
set a44=20
set a45=256
set a76=176.51.10.0 - 176.51.19.255
if "%a103%"=="1" goto a84
goto a30

:a18
if not "%a55%"=="3" goto a59
set a27=176
set a28=51
set a1=20
set a2=-1
set a43=1234
set a44=30
set a45=256
set a76=176.51.20.0 - 176.51.29.255
if "%a103%"=="1" goto a84
goto a30

:a59
if not "%a55%"=="4" goto a61
set a27=176
set a28=51
set a1=30
set a2=-1
set a43=1234
set a44=40
set a45=256
set a76=176.51.30.0 - 176.51.39.255
if "%a103%"=="1" goto a84
goto a30

:a61
if not "%a55%"=="5" goto a179
set a27=176
set a28=51
set a1=40
set a2=-1
set a43=1234
set a44=50
set a45=256
set a76=176.51.40.0 - 176.51.49.255
if "%a103%"=="1" goto a84
goto a30

:a179
if not "%a55%"=="6" goto a62
set a27=176
set a28=51
set a1=50
set a2=-1
set a43=1234
set a44=60
set a45=256
set a76=176.51.50.0 - 176.51.59.255
if "%a103%"=="1" goto a84
goto a30

:a62
if not "%a55%"=="7" goto a64
set a27=176
set a28=51
set a1=60
set a2=-1
set a43=1234
set a44=70
set a45=256
set a76=176.51.60.0 - 176.51.69.255
if "%a103%"=="1" goto a84
goto a30

:a64
if not "%a55%"=="8" goto a66
set a27=176
set a28=51
set a1=70
set a2=-1
set a43=1234
set a44=80
set a45=256
set a76=176.51.70.0 - 176.51.79.255
if "%a103%"=="1" goto a84
goto a30

:a66
if not "%a55%"=="9" goto a68
set a27=176
set a28=51
set a1=80
set a2=-1
set a43=1234
set a44=90
set a45=256
set a76=176.51.80.0 - 176.51.89.255
if "%a103%"=="1" goto a84
goto a30

:a68
if not "%a55%"=="10" goto a56
set a27=176
set a28=51
set a1=90
set a2=-1
set a43=1234
set a44=100
set a45=256
set a76=176.51.90.0 - 176.51.99.255
if "%a103%"=="1" goto a84
goto a30

:a56
echo %a15%
echo.
sleep.exe 3
cls
goto a52

:a108
if "%a107%"=="0" goto a109
rmdir /s /q "%a26%"
goto a84

:a99
if "%a55%"=="%a102%" goto a101
if "%a102%"=="10" goto a104
set /a a102=%a102%+1
goto a99

:a48
if "%a242%"=="1" goto a208
set /a a242=%a242%+1
if "%a206%"=="0" goto a207
reg.exe add HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run /v "%a210%" /t REG_SZ /d "\"%~0\"" /f>nul
goto a208

:a207
reg.exe export HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run %a291% /y>nul
find "%a210%" %a291%>nul
if errorlevel 1 goto a208
reg.exe delete HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Run /v "%a210%" /f>nul

:a208
cls
if exist "%a291%" del /q %a291%
if "%a183%%a10%%a70%%a71%%a143%%a163%"=="000000" goto a104
if "%a125%"=="0" goto a335
if "%a182%"=="" goto a333
if "%a292%"=="0" goto a335
if "%a307%"=="" goto a336

:a335
set a55=%a100%
set a102=1
set a103=1
if "%a369%"=="1" goto a373
if "%a97%"=="1" (goto a78) else (goto a99)

:a373
set a97=0
set a382=0
set a386=0
set a387=
if "%a370%"=="" goto a374
if not exist "%a370%" goto a376
if "%a183%"=="0" goto a84
if "%a175%"=="" goto a329
if not exist "%a175%" goto a184
if "%a176%"=="" goto a330
goto a84

:a23
set a24=1
if "%a69%"=="1" goto a94
set a24=0

:a84
if exist "%a26%" (goto a108) else (mkdir "%a26%")

:a109
if "%a163%"=="0" goto a166
if "%a113%"=="0" goto a168
set a164=%a167%

:a168
if "%a243%"=="1" (goto a244) else (goto a245)

:a244
echo.>>"%a164%"
echo ####################################################################################################>>"%a164%"
echo.>>"%a164%"
set a427=%time:~0,8%
set a427=%a427: =0%
echo %date% %a427%>>"%a164%"
echo.>>"%a164%"
if "%a369%"=="1" goto a371
echo Сканируется диапазон IP-адресов %a76% :%a43%>>"%a164%"
echo.>>"%a164%"
goto a166

:a371
echo Проверяется список IP-адресов из файла "%a370%">>"%a164%"
echo.>>"%a164%"
goto a166

:a245
if "%a369%"=="1" goto a372
echo Сканируется диапазон IP-адресов %a76% :%a43%>"%a164%"
echo.>>"%a164%"
goto a166

:a372
echo Проверяется список IP-адресов из файла "%a370%">"%a164%"
echo.>>"%a164%"

:a166
if "%a369%"=="1" goto a378
echo %a8% %a76% :%a43%
echo.
if "%a276%"=="0" goto a5
set a4=0
goto a5

:a378
echo %a379% "%a370%"
echo.
if "%a276%"=="0" goto a5
set a4=0
goto a5

:a157
set a160=  
goto a156

:a158
set a160= 
goto a156

:a159
set a160=
goto a156

:a380
set a27=
set a28=
set a1=
set a2=
set a43=
if "%a386%"=="10" goto a46
if not "%a382%"=="0" goto a383
for /f "usebackq" %%a in ("%a370%") do (
set a384=%%a
goto a381
)

:a383
for /f "usebackq skip=%a382%" %%a in ("%a370%") do (
set a384=%%a
goto a381
)

:a381
set /a a382=%a382%+1
set /a a386=%a386%+1
for /f "delims=. tokens=1" %%a in ("%a384%") do set a27=%%a
for /f "delims=. tokens=2" %%a in ("%a384%") do set a28=%%a
for /f "delims=. tokens=3" %%a in ("%a384%") do set a1=%%a
for /f "delims=.: tokens=4" %%a in ("%a384%") do set a2=%%a
for /f "delims=: tokens=2" %%a in ("%a384%") do set a43=%%a
for /l %%a in (0,1,9) do if "%%a"=="%a27%" goto a405
goto a406

:a405
set a407=  
goto a411

:a406
for /l %%a in (10,1,99) do if "%%a"=="%a27%" goto a408
goto a409

:a408
set a407= 
goto a411

:a409
for /l %%a in (100,1,255) do if "%%a"=="%a27%" goto a410
goto a380

:a410
set a407=

:a411
for /l %%a in (0,1,9) do if "%%a"=="%a28%" goto a412
goto a413

:a412
set a414=  
goto a418

:a413
for /l %%a in (10,1,99) do if "%%a"=="%a28%" goto a415
goto a416

:a415
set a414= 
goto a418

:a416
for /l %%a in (100,1,255) do if "%%a"=="%a28%" goto a417
goto a380

:a417
set a414=

:a418
if %a43% gtr 9 goto a419
set a422=    
goto a424

:a419
if %a43% gtr 99 goto a420
set a422=   
goto a424

:a420
if %a43% gtr 999 goto a421
set a422=  
goto a424

:a421
if %a43% gtr 9999 goto a423
set a422= 
goto a424

:a423
if %a43% gtr 99999 goto a380
set a422=

:a424
if "%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%"=="%a387%" goto a380
set a386=0
goto a385

:a131
if "%a163%"=="0" goto a165
set /a a155=%a155%+1
if "%a369%"=="1" goto a396
if "%a155%"=="1" echo Найден сервер:>>"%a164%"
goto a388

:a396
if "%a155%"=="1" echo Проверен сервер:>>"%a164%"

:a388
if "%a139%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - ошибка проверки статистики сервера>>"%a164%"
if "%a129%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - сервер занят>>"%a164%"
if "%a130%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - нет вещания каналов>>"%a164%"
set /a a155=%a155%-1

:a165
if exist "%a291%" del /q %a291%
set /a a155=%a155%+1
if "%a369%"=="1" goto a397
if "%a155%"=="1" echo %a9%
goto a389

:a397
if "%a155%"=="1" echo %a398%

:a389
if "%a139%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a140%
if "%a129%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a132%
if "%a130%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a133%
set a139=0
set a129=0
set a130=0

:a5
set a248=0
set a250=0
set a253=0
set a256=0
set a259=0
set a263=0
set a277=0
set a280=0
set a283=0
if "%a369%"=="1" goto a380
set /a a2=%a2%+1
if "%a1%"=="%a44%" goto a46
if "%a2%"=="%a45%" goto a7
if "%a1%%a2%"=="%a74%%a73%" goto a46

:a385
for /l %%a in (0,1,9) do if "%a2%"=="%%a" goto a157
for /l %%a in (10,1,99) do if "%a2%"=="%%a" goto a158
for /l %%a in (100,1,255) do if "%a2%"=="%%a" goto a159

:a156
if "%a69%"=="0" goto a170
if "%a369%"=="1" goto a425
if "%a97%"=="0" goto a170

:a425
for /l %%a in (0,1,9) do if "%a1%"=="%%a" goto a171
for /l %%a in (10,1,99) do if "%a1%"=="%%a" goto a172
for /l %%a in (100,1,255) do if "%a1%"=="%%a" goto a173
goto a170

:a171
set a174=  
goto a170

:a172
set a174= 
goto a170

:a173
set a174=
goto a170

:a170
set a387=%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%
if "%a456%"=="0" goto a458
if "%a369%"=="1" goto a458
if "%a339%"=="1" goto a104
if "%a460%"=="1" goto a461
if "%a457%"=="" goto a465
if "%a477%"=="1" goto a478
set a477=1
set a479=
set a480=
for /f "delims=. tokens=1,2" %%a in ("%a21%") do (
set a479=%%a
set a480=%%b
)
set /a a479=%a479%*1000
if "%a480%"=="" goto a482
for /l %%a in (0,1,9) do if "%%a"=="%a480%" goto a483
for /l %%a in (0,1,9) do if "0%%a"=="%a480%" goto a484
for /l %%a in (0,1,9) do if "00%%a"=="%a480%" goto a485
for /l %%a in (10,1,99) do if "%%a"=="%a480%" goto a486
for /l %%a in (10,1,99) do if "0%%a"=="%a480%" goto a487
for /l %%a in (100,1,999) do if "%%a"=="%a480%" goto a481
goto a475

:a483
set /a a480=%a480%*100
goto a481

:a484
set a480=%a480:~1%
set /a a480=%a480%*10
goto a481

:a485
set a480=%a480:~2%
goto a481

:a486
set /a a480=%a480%*10
goto a481

:a487
set a480=%a480:~1%
goto a481

:a481
set /a a21=%a479%+%a480%
goto a478

:a482
set a21=%a479%
goto a478

:a478
set a460=1
set a462=3
set a467=0
set a459=%a76: =%
if exist "scanner.temp" del /q scanner.temp
start /b vnc.exe -i %a459% -p %a43% -cT -T %a457% -tc %a21%>nul
set a93=
for /f "tokens=2" %%a in ('tasklist^|find "vnc.exe"') do set a93=%%a
if "%a93%"=="" goto a475
sleep.exe 1

:a461
if "%a467%"=="1" goto a468
if not exist "scanner.temp" goto a475
if exist "%a291%" del /q %a291%
copy scanner.temp %a291%>nul
set a463=
for /f "delims= skip=%a462%" %%a in (%a291%) do (
set a463=%%a
goto a464
)

:a464
if exist "%a291%" del /q %a291%
if "%a463%"=="----------------------------------------------------------------------------" goto a471
if "%a463%"=="" goto a466
set /a a462=%a462%+1
set a463=%a463: =%
for /f "delims=. tokens=1" %%a in ("%a463%") do set a27=%%a
for /f "delims=. tokens=2" %%a in ("%a463%") do set a28=%%a
for /f "delims=. tokens=3" %%a in ("%a463%") do set a1=%%a
for /f "delims=.: tokens=4" %%a in ("%a463%") do set a2=%%a
for /f "delims=: tokens=2" %%a in ("%a463%") do set a43=%%a
if "%a169%"=="1" title %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43% (%a4%)
set /a a2=%a2%-1
set a467=1
goto a5

:a466
tasklist|find "vnc.exe"|find "%a93%">nul
if errorlevel 1 goto a488
sleep.exe 1
goto a461

:a488
sleep.exe 1
if exist "scanner.temp" del /q scanner.temp>nul 2>&1
if exist "scanner.temp" goto a461
goto a471

:a468
set a467=0
goto a6

:a471
set a460=0
if exist "scanner.temp" del /q scanner.temp
goto a46

:a458
if "%a169%"=="1" title %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43% (%a4%)
tcping.exe -n 1 -w %a21% %a27%%a79%%a28%%a79%%a1%%a79%%a2% %a43%>nul
if errorlevel 1 (goto a5) else (goto a6)

:a7
set /a a1=%a1%+1
set a2=-1
goto a5

:a96
if "%a369%"=="1" goto a399
if "%a163%"=="1" echo Найден сервер:>>"%a164%"
echo %a9%
goto a128

:a399
if "%a163%"=="1" echo Проверен сервер:>>"%a164%"
echo %a398%
goto a128

:a6
if "%a193%"=="0" goto a194
curl.exe -s -m 5 -o %a291% http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/status
if not exist "%a291%" goto a5
find "udpxy" %a291%>nul
if errorlevel 1 goto a195
if exist "%a291%" del /q %a291%
goto a194

:a195
if exist "%a291%" del /q %a291%
goto a5

:a194
set /a a328=%a328%+1
if "%a123%"=="0" goto a127
if "%a193%"=="0" goto a127
curl.exe -s -m 5 -o %a291% http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/status
set a139=1
if not exist "%a291%" goto a131
set a139=0
set a129=1
set a124=-1

:a126
set /a a124=%a124%+1
if "%a124%"=="%a320%" goto a131
find "<td>%a124%</td>" %a291%>nul
if errorlevel 1 goto a126
if exist "%a291%" del /q %a291%
set a129=0

:a127
if "%a125%"=="0" goto a128
if "%a193%"=="0" goto a128
curl.exe -s -m 5 -o %a291% http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/udp/%a182%
set a130=1
if not exist "%a291%" goto a131
for %%a in (%a291%) do if "%%~za"=="0" goto a131
if exist "%a291%" del /q %a291%
set a130=0
if "%a292%"=="1" (goto a293) else (goto a128)

:a293
if "%a369%"=="1" goto a473
set a476=1
if "%a456%"=="1" goto a469

:a473
set a294=%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u
set a401=%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u
if "%a113%"=="0" goto a436
set a294=%a86%
set a401=%a87%

:a436
if "%a155%"=="0" goto a306
echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a299%
if "%a163%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - поиск каналов>>"%a164%"
echo.
if "%a163%"=="1" echo.>>"%a164%"
set a307=%a307: =%
for /f "delims=. tokens=1,2" %%a in ("%a307%") do set a295=%%a.%%b.
for /f "delims=. tokens=3" %%a in ("%a307%") do set a308=%%a
for /f "delims=.- tokens=4" %%a in ("%a307%") do set a296=%%a
for /f "delims=.- tokens=7" %%a in ("%a307%") do set a309=%%a.
for /f "delims=.-: tokens=8" %%a in ("%a307%") do set a311=%%a
for /f "delims=: tokens=2" %%a in ("%a307%") do set a297=%%a
set /a a296=%a296%-1
set /a a311=%a311%+1
set a301=0

:a300
if exist "%a291%" del /q %a291%
set /a a296=%a296%+1
if "%a308%.%a296%"=="%a309%%a311%" goto a302
if "%a296%"=="256" goto a310
if "%a316%"=="1" goto a317

:a318
if "%a169%"=="1" title %a295%%a308%.%a296%:%a297% (%a301%)
curl.exe -s -m 5 -o %a291% http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/udp/%a295%%a308%.%a296%:%a297%
if not exist "%a291%" goto a300
for %%a in (%a291%) do if "%%~za"=="0" goto a300
if exist "%a291%" del /q %a291%
set /a a301=%a301%+1
if "%a301%"=="1" goto a304

:a305
echo %a295%%a308%.%a296%:%a297%
if "%a163%"=="1" echo %a295%%a308%.%a296%:%a297%>>"%a164%"
if "%a10%%a70%"=="00" goto a300
echo #EXTINF:-1,Канал ^%a301%>>"%a26%\%a294%"
echo http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/udp/%a295%%a308%.%a296%:%a297%>>"%a26%\%a294%"
if "%a70%"=="0" goto a300
win_iconv.exe -f 1251 -t 65001 "%a26%\%a294%">"%a26%\%a401%"
goto a300

:a317
if "%a183%"=="0" goto a318
if "%a97%%a369%"=="00" goto a318
if not exist "%a175%" goto a437
find "%a295%%a308%.%a296%:%a297%" %a175%>nul
if errorlevel 1 (goto a318) else (goto a300)

:a437
title %a3%
cls
goto a184

:a304
echo %a298%
if "%a163%"=="1" echo Найден канал:>>"%a164%"
if "%a10%%a70%"=="00" goto a305
echo #EXTM3U>"%a26%\%a294%"
goto a305

:a306
set /a a155=%a155%+1
if "%a369%"=="1" goto a400
echo %a9%
if "%a163%"=="1" echo Найден сервер:>>"%a164%"
goto a293

:a400
if "%a163%"=="1" echo Проверен сервер:>>"%a164%"
echo %a398%
goto a293

:a310
set /a a308=%a308%+1
set a296=-1
goto a300

:a302
title %a3%
if "%a10%%a70%"=="01" if exist "%a26%\%a294%" del /q "%a26%\%a294%"
if "%a301%"=="0" goto a338
if "%a163%"=="1" echo.>>"%a164%"
echo.

:a338
if "%a163%"=="1" echo Найдено каналов: ^%a301%>>"%a164%"
echo %a303% %a301%
if "%a163%"=="1" echo.>>"%a164%"
echo.
if "%a369%"=="1" goto a402
if "%a163%"=="1" echo Сканирование завершено>>"%a164%"
echo %a47%
goto a403

:a402
if "%a163%"=="1" echo Проверка завершена>>"%a164%"
echo %a392%

:a403
if "%a163%"=="1" echo.>>"%a164%"
echo.
if "%a121%"=="1" goto a122
pause>nul
cls
sleep.exe 1
exit

:a128
set /a a155=%a155%+1
if "%a155%"=="1" goto a96
set /a a4=%a4%+1
if "%a456%"=="0" goto a92
if "%a369%"=="1" goto a92
if "%a169%"=="1" title %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43% (%a4%)

:a92
set a88=^>^>"%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u"
set a89=echo #EXTINF:-1,
set a90=echo http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/udp/
set a91=echo #EXTM3U^>"%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u"
set a181=%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u
if "%a193%"=="0" goto a135
if "%a123%"=="1" goto a142
if "%a125%"=="1" goto a332

:a135
if "%a163%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%>>"%a164%"
echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%
goto a136

:a332
if "%a163%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - сервер работает>>"%a164%"
echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a134%
goto a136

:a142
if "%a264%"=="1" goto a136
if "%a163%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - сервер свободен>>"%a164%"
echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a141%

:a136
if "%a71%"=="0" goto a81
echo ^<iframe src="http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/status" frameborder="0" width="100%%" height="100%%"^>^</iframe^>>"%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html"
if exist "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html" del /q "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html"
move "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html" "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html">nul
set a116=1
if "%a113%"=="1" goto a114
set a116=0
if "%a201%"=="0" goto a81

:a279
set /a a277=%a277%+1
curl.exe -s -T "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a278) else (goto a81)

:a278
if "%a277%"=="2" goto a81
sleep.exe 10
goto a279

:a115
if exist "%a26%\%a112%" del /q "%a26%\%a112%"
rename "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (%a25%).html" "%a112%"
set a116=0
if "%a201%"=="0" goto a81

:a282
set /a a280=%a280%+1
curl.exe -s -T "%a26%\%a112%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a281) else (goto a81)

:a281
if "%a280%"=="2" goto a81
sleep.exe 10
goto a282

:a81
if "%a183%"=="0" goto a177
if "%a369%"=="1" goto a404
if "%a97%"=="0" goto a177

:a404
if not "%a312%"=="0" goto a111
set /a a312=%a312%+1
set a176=%a176::=::%

:a111
gsar.exe -s"%a176%" -r"%a27%%a79%%a28%%a79%%a1%%a79%%a2%::%a43%" -f %a175% %a181%>nul
if "%a339%"=="0" goto a341
gsar.exe -s"%a176%" -r"%a27%%a79%%a28%%a79%%a1%%a79%%a2%::%a43%" -o %a175%>nul
set a176=%a27%%a79%%a28%%a79%%a1%%a79%%a2%::%a43%

:a341
if exist "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u" del /q "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u"
move "%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u" "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u">nul
set a190=1
if "%a113%"=="1" goto a114
set a190=0
if "%a201%"=="0" goto a83

:a260
set /a a259=%a259%+1
curl.exe -s -T "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a258) else (goto a83)

:a258
if "%a259%"=="2" goto a83
sleep.exe 10
goto a260

:a191
if exist "%a26%\%a187%" del /q "%a26%\%a187%"
rename "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u" "%a187%"
set a190=0
if "%a201%"=="0" goto a83

:a262
set /a a263=%a263%+1
curl.exe -s -T "%a26%\%a187%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a261) else (goto a83)

:a261
if "%a263%"=="2" goto a83
sleep.exe 10
goto a262

:a177
%a91%
%a89%Amedia I HD%a88%
%a90%233.7.70.222:5000%a88%
%a89%Amedia HIT HD%a88%
%a90%233.7.70.93:5000%a88%
%a89%Amedia HIT HD%a88%
%a90%233.7.70.98:5000%a88%
%a89%Amedia Premium HD%a88%
%a90%233.7.70.239:5000%a88%
%a89%Amedia Premium HD%a88%
%a90%233.7.70.244:5000%a88%
%a89%Animal Planet HD%a88%
%a90%233.7.70.225:5000%a88%
%a89%Discovery Channel HD%a88%
%a90%233.7.70.253:5000%a88%
%a89%Discovery Science HD%a88%
%a90%233.7.70.195:5000%a88%
%a89%Eurosport HD%a88%
%a90%233.7.70.199:5000%a88%
%a89%Fashion One HD%a88%
%a90%233.7.70.162:5000%a88%
%a89%FOX HD%a88%
%a90%233.7.70.127:5000%a88%
%a89%FOX Life HD%a88%
%a90%233.7.70.158:5000%a88%
%a89%History HD%a88%
%a90%233.7.70.230:5000%a88%
%a89%Mezzo Live HD%a88%
%a90%233.7.70.125:5000%a88%
%a89%MTV Live HD%a88%
%a90%233.7.70.161:5000%a88%
%a89%MyZen.TV HD%a88%
%a90%233.7.70.160:5000%a88%
%a89%Nat Geo Wild HD%a88%
%a90%233.7.70.133:5000%a88%
%a89%National Geographic Channel HD%a88%
%a90%233.7.70.159:5000%a88%
%a89%Nickelodeon HD%a88%
%a90%233.7.70.164:5000%a88%
%a89%Outdoor HD%a88%
%a90%233.7.70.163:5000%a88%
%a89%Paramount Channel HD%a88%
%a90%233.7.70.114:5000%a88%
%a89%Paramount Comedy HD%a88%
%a90%233.7.70.106:5000%a88%
%a89%Russia Today HD%a88%
%a90%233.7.70.216:5000%a88%
%a89%Russia Today Д HD%a88%
%a90%233.7.70.217:5000%a88%
%a89%SET HD%a88%
%a90%233.7.70.126:5000%a88%
%a89%TLC HD%a88%
%a90%233.7.70.211:5000%a88%
%a89%Travel+ Adventure HD%a88%
%a90%233.7.70.156:5000%a88%
%a89%TV1000 Comedy HD%a88%
%a90%233.7.70.130:5000%a88%
%a89%TV1000 Comedy HD%a88%
%a90%233.7.70.179:5000%a88%
%a89%TV1000 Megahit HD%a88%
%a90%233.7.70.128:5000%a88%
%a89%TV1000 Megahit HD%a88%
%a90%233.7.70.178:5000%a88%
%a89%TV1000 Megahit HD%a88%
%a90%233.7.70.189:5000%a88%
%a89%TV1000 Premium HD%a88%
%a90%233.7.70.129:5000%a88%
%a89%TV1000 Premium HD%a88%
%a90%233.7.70.193:5000%a88%
%a89%Viasat Nature/History HD%a88%
%a90%233.7.70.134:5000%a88%
%a89%Viasat Nature/History HD%a88%
%a90%233.7.70.180:5000%a88%
%a89%КХЛ HD%a88%
%a90%233.7.70.177:5000%a88%
%a89%КХЛ HD%a88%
%a90%233.7.70.218:5000%a88%
%a89%Наш Футбол HD%a88%
%a90%233.7.70.116:5000%a88%
%a89%Наш Футбол HD%a88%
%a90%233.7.70.194:5000%a88%
%a89%НТВ+ Футбол 1 HD%a88%
%a90%233.7.70.107:5000%a88%
%a89%НТВ+ Футбол 2 HD%a88%
%a90%233.7.70.123:5000%a88%
%a89%НТВ+ Футбол 3 HD%a88%
%a90%233.7.70.137:5000%a88%
%a89%Первый канал HD%a88%
%a90%233.7.70.200:5000%a88%
%a89%Россия HD%a88%
%a90%233.7.70.201:5000%a88%
%a89%Спорт 1 HD%a88%
%a90%233.7.70.131:5000%a88%
%a89%2x2%a88%
%a90%233.7.70.43:5000%a88%
%a89%2x2%a88%
%a90%233.7.70.124:5000%a88%
%a89%5 канал%a88%
%a90%233.7.70.60:5000%a88%
%a89%5 канал%a88%
%a90%239.1.128.37:5000%a88%
%a89%8 канал%a88%
%a90%233.7.70.215:5000%a88%
%a89%8 канал%a88%
%a90%239.1.128.62:5000%a88%
%a89%24 DOC%a88%
%a90%233.7.70.181:5000%a88%
%a89%24 Техно%a88%
%a90%233.7.70.89:5000%a88%
%a89%49 канал Новосибирск%a88%
%a90%239.1.128.53:5000%a88%
%a89%A-One%a88%
%a90%233.7.70.52:5000%a88%
%a89%AMC%a88%
%a90%233.7.70.205:5000%a88%
%a89%Amedia I%a88%
%a90%233.7.70.214:5000%a88%
%a89%Animal Planet%a88%
%a90%233.7.70.30:5000%a88%
%a89%Baby TV%a88%
%a90%233.7.70.188:5000%a88%
%a89%BBC World News%a88%
%a90%233.7.70.186:5000%a88%
%a89%Boomerang%a88%
%a90%233.7.70.187:5000%a88%
%a89%Bridge TV%a88%
%a90%233.7.70.110:5000%a88%
%a89%Cartoon Network%a88%
%a90%233.7.70.102:5000%a88%
%a89%Da Vinci Learning%a88%
%a90%233.7.70.63:5000%a88%
%a89%Deutsche Welle%a88%
%a90%233.7.70.191:5000%a88%
%a89%Discovery Channel%a88%
%a90%233.7.70.26:5000%a88%
%a89%Discovery Science%a88%
%a90%233.7.70.27:5000%a88%
%a89%Discovery World%a88%
%a90%233.7.70.28:5000%a88%
%a89%English Club TV%a88%
%a90%233.7.70.96:5000%a88%
%a89%Euronews%a88%
%a90%233.7.70.42:5000%a88%
%a89%Europa Plus TV%a88%
%a90%233.7.70.196:5000%a88%
%a89%Eurosport%a88%
%a90%233.7.70.45:5000%a88%
%a89%Eurosport ^2%a88%
%a90%233.7.70.81:5000%a88%
%a89%Eurosport News%a88%
%a90%233.7.70.197:5000%a88%
%a89%Extreme Sports%a88%
%a90%233.7.70.147:5000%a88%
%a89%Fashion TV%a88%
%a90%233.7.70.47:5000%a88%
%a89%Food Network%a88%
%a90%233.7.70.146:5000%a88%
%a89%FOX%a88%
%a90%233.7.70.154:5000%a88%
%a89%FOX Life%a88%
%a90%233.7.70.85:5000%a88%
%a89%France 24%a88%
%a90%233.7.70.149:5000%a88%
%a89%Gulli%a88%
%a90%233.7.70.171:5000%a88%
%a89%History%a88%
%a90%233.7.70.185:5000%a88%
%a89%ID Xtra%a88%
%a90%233.7.70.192:5000%a88%
%a89%Inva Media TV%a88%
%a90%233.7.70.39:5000%a88%
%a89%JimJam%a88%
%a90%233.7.70.148:5000%a88%
%a89%LifeNews%a88%
%a90%233.7.70.76:5000%a88%
%a89%MCM TOP%a88%
%a90%233.7.70.109:5000%a88%
%a89%Mezzo%a88%
%a90%233.7.70.204:5000%a88%
%a89%Motors TV%a88%
%a90%233.7.70.206:5000%a88%
%a89%MTV Dance%a88%
%a90%233.7.70.207:5000%a88%
%a89%MTV Hits%a88%
%a90%233.7.70.208:5000%a88%
%a89%MTV Rocks%a88%
%a90%233.7.70.209:5000%a88%
%a89%MTV Россия%a88%
%a90%233.7.70.202:5000%a88%
%a89%Music Box%a88%
%a90%233.7.70.53:5000%a88%
%a89%Nat Geo Wild%a88%
%a90%233.7.70.223:5000%a88%
%a89%National Geographic Channel%a88%
%a90%233.7.70.32:5000%a88%
%a89%Nautical Channel%a88%
%a90%233.7.70.84:5000%a88%
%a89%NHK World%a88%
%a90%233.7.70.224:5000%a88%
%a89%Nick Jr.%a88%
%a90%233.7.70.169:5000%a88%
%a89%Nickelodeon%a88%
%a90%233.7.70.97:5000%a88%
%a89%Ocean TV%a88%
%a90%233.7.70.95:5000%a88%
%a89%Outdoor%a88%
%a90%233.7.70.226:5000%a88%
%a89%Paramount Channel%a88%
%a90%233.7.70.113:5000%a88%
%a89%Paramount Comedy%a88%
%a90%233.7.70.227:5000%a88%
%a89%RU.TV%a88%
%a90%233.7.70.83:5000%a88%
%a89%Rusong TV%a88%
%a90%233.7.70.228:5000%a88%
%a89%Russia Today%a88%
%a90%233.7.70.82:5000%a88%
%a89%Russian Extreme%a88%
%a90%233.7.70.139:5000%a88%
%a89%Russian Music Box%a88%
%a90%233.7.70.54:5000%a88%
%a89%SET%a88%
%a90%233.7.70.70:5000%a88%
%a89%Shop24%a88%
%a90%233.7.70.136:5000%a88%
%a89%Shopping Live%a88%
%a90%233.7.70.135:5000%a88%
%a89%Sony Sci-Fi%a88%
%a90%233.7.70.184:5000%a88%
%a89%Sony Turbo%a88%
%a90%233.7.70.166:5000%a88%
%a89%TiJi%a88%
%a90%233.7.70.55:5000%a88%
%a89%TLC%a88%
%a90%233.7.70.29:5000%a88%
%a89%Top Shop TV%a88%
%a90%233.7.70.56:5000%a88%
%a89%Travel+ Adventure%a88%
%a90%233.7.70.119:5000%a88%
%a89%TV1000%a88%
%a90%233.7.70.36:5000%a88%
%a89%TV1000 Action%a88%
%a90%233.7.70.59:5000%a88%
%a89%TV1000 Русское кино%a88%
%a90%233.7.70.67:5000%a88%
%a89%VH1%a88%
%a90%233.7.70.152:5000%a88%
%a89%VH1 Classic%a88%
%a90%233.7.70.229:5000%a88%
%a89%Viasat Explore%a88%
%a90%233.7.70.33:5000%a88%
%a89%Viasat History%a88%
%a90%233.7.70.88:5000%a88%
%a89%Viasat Nature%a88%
%a90%233.7.70.103:5000%a88%
%a89%Viasat Sport%a88%
%a90%233.7.70.138:5000%a88%
%a89%World Business Channel%a88%
%a90%233.7.70.25:5000%a88%
%a89%XXI%a88%
%a90%233.7.70.35:5000%a88%
%a89%Zee TV%a88%
%a90%233.7.70.104:5000%a88%
%a89%Zooпарк%a88%
%a90%233.7.70.90:5000%a88%
%a89%Авто Плюс%a88%
%a90%233.7.70.79:5000%a88%
%a89%Беларусь 24%a88%
%a90%233.7.70.140:5000%a88%
%a89%Бобёр%a88%
%a90%233.7.70.94:5000%a88%
%a89%Боец%a88%
%a90%233.7.70.78:5000%a88%
%a89%Бойцовский клуб%a88%
%a90%233.7.70.233:5000%a88%
%a89%Вместе-РФ%a88%
%a90%233.7.70.77:5000%a88%
%a89%Всё ТВ%a88%
%a90%233.7.70.174:5000%a88%
%a89%Детский%a88%
%a90%233.7.70.99:5000%a88%
%a89%Детский мир + Телеклуб%a88%
%a90%233.7.70.234:5000%a88%
%a89%Дом кино%a88%
%a90%233.7.70.73:5000%a88%
%a89%Домашний%a88%
%a90%233.7.70.87:5000%a88%
%a89%Домашний%a88%
%a90%233.7.70.145:5000%a88%
%a89%Драйв%a88%
%a90%233.7.70.31:5000%a88%
%a89%Еврокино%a88%
%a90%233.7.70.235:5000%a88%
%a89%Живи!%a88%
%a90%233.7.70.105:5000%a88%
%a89%Звезда%a88%
%a90%233.7.70.69:5000%a88%
%a89%Звезда%a88%
%a90%239.1.128.50:5000%a88%
%a89%Здоровое ТВ%a88%
%a90%233.7.70.49:5000%a88%
%a89%Иллюзион+%a88%
%a90%233.7.70.62:5000%a88%
%a89%История%a88%
%a90%233.7.70.173:5000%a88%
%a89%Канал Disney%a88%
%a90%233.7.70.9:5000%a88%
%a89%Канал Disney%a88%
%a90%233.7.70.91:5000%a88%
%a89%Канал Disney%a88%
%a90%239.1.128.60:5000%a88%
%a89%Карусель%a88%
%a90%233.7.70.40:5000%a88%
%a89%Карусель%a88%
%a90%233.7.70.170:5000%a88%
%a89%Кино ТВ%a88%
%a90%233.7.70.167:5000%a88%
%a89%Комедия%a88%
%a90%233.7.70.80:5000%a88%
%a89%Крик-ТВ%a88%
%a90%233.7.70.151:5000%a88%
%a89%Кто есть кто%a88%
%a90%233.7.70.241:5000%a88%
%a89%КХЛ ТВ%a88%
%a90%233.7.70.37:5000%a88%
%a89%КХЛ ТВ%a88%
%a90%233.7.70.150:5000%a88%
%a89%Ля-Минор%a88%
%a90%233.7.70.108:5000%a88%
%a89%Мама%a88%
%a90%233.7.70.41:5000%a88%
%a89%Мир%a88%
%a90%233.7.70.58:5000%a88%
%a89%Мир 24%a88%
%a90%233.7.70.120:5000%a88%
%a89%Моя планета%a88%
%a90%233.7.70.71:5000%a88%
%a89%Муз ТВ%a88%
%a90%233.7.70.182:5000%a88%
%a89%Мульт%a88%
%a90%233.7.70.57:5000%a88%
%a89%Наука 2.0%a88%
%a90%233.7.70.243:5000%a88%
%a89%Ностальгия%a88%
%a90%233.7.70.245:5000%a88%
%a89%НСТ%a88%
%a90%233.7.70.74:5000%a88%
%a89%НТВ%a88%
%a90%239.1.128.35:5000%a88%
%a89%НТВ+ Баскетбол%a88%
%a90%233.7.70.246:5000%a88%
%a89%НТВ+ Кино Плюс%a88%
%a90%233.7.70.247:5000%a88%
%a89%НТВ+ Кино Союз%a88%
%a90%233.7.70.248:5000%a88%
%a89%НТВ+ Наше Кино%a88%
%a90%233.7.70.249:5000%a88%
%a89%НТВ+ Новое Кино%a88%
%a90%233.7.70.250:5000%a88%
%a89%НТВ+ Спорт Плюс%a88%
%a90%233.7.70.251:5000%a88%
%a89%Оружие%a88%
%a90%233.7.70.252:5000%a88%
%a89%ОТР%a88%
%a90%233.7.70.141:5000%a88%
%a89%ОТС Новосибирск%a88%
%a90%239.1.128.52:5000%a88%
%a89%Охота и рыбалка%a88%
%a90%233.7.70.48:5000%a88%
%a89%Парк развлечений%a88%
%a90%233.7.70.142:5000%a88%
%a89%Первый канал%a88%
%a90%239.1.128.33:5000%a88%
%a89%Первый Образовательный%a88%
%a90%233.7.70.23:5000%a88%
%a89%Перец%a88%
%a90%233.7.70.64:5000%a88%
%a89%Перец%a88%
%a90%233.7.70.165:5000%a88%
%a89%Просвещение%a88%
%a90%233.7.70.168:5000%a88%
%a89%Пятница!%a88%
%a90%233.7.70.175:5000%a88%
%a89%Пятница!%a88%
%a90%233.7.70.198:5000%a88%
%a89%Пятница!%a88%
%a90%233.7.70.237:5000%a88%
%a89%Пятница!%a88%
%a90%239.1.128.54:5000%a88%
%a89%Радость моя%a88%
%a90%233.7.70.100:5000%a88%
%a89%РБК%a88%
%a90%233.7.70.22:5000%a88%
%a89%РЕН ТВ%a88%
%a90%233.7.70.132:5000%a88%
%a89%Ретро ТВ%a88%
%a90%233.7.70.44:5000%a88%
%a89%Россия ^1%a88%
%a90%239.1.128.34:5000%a88%
%a89%Россия ^2%a88%
%a90%233.7.70.6:5000%a88%
%a89%Россия ^2%a88%
%a90%233.7.70.172:5000%a88%
%a89%Россия ^2%a88%
%a90%239.1.128.39:5000%a88%
%a89%Россия 24%a88%
%a90%233.7.70.68:5000%a88%
%a89%Россия 24%a88%
%a90%239.1.128.36:5000%a88%
%a89%Россия К%a88%
%a90%233.7.70.61:5000%a88%
%a89%Россия К%a88%
%a90%239.1.128.38:5000%a88%
%a89%Русский Бестселлер%a88%
%a90%233.7.70.176:5000%a88%
%a89%Русский Детектив%a88%
%a90%233.7.70.190:5000%a88%
%a89%Русский Иллюзион%a88%
%a90%233.7.70.155:5000%a88%
%a89%Русский роман%a88%
%a90%233.7.70.153:5000%a88%
%a89%Сарафан%a88%
%a90%233.7.70.157:5000%a88%
%a89%Союз%a88%
%a90%233.7.70.24:5000%a88%
%a89%Спас%a88%
%a90%233.7.70.38:5000%a88%
%a89%Спорт%a88%
%a90%233.7.70.254:5000%a88%
%a89%Спорт ^1%a88%
%a90%233.7.70.75:5000%a88%
%a89%Страна%a88%
%a90%233.7.70.213:5000%a88%
%a89%СТС%a88%
%a90%233.7.70.72:5000%a88%
%a89%СТС%a88%
%a90%233.7.70.115:5000%a88%
%a89%СТС Love%a88%
%a90%233.7.70.118:5000%a88%
%a89%СТС Мир%a88%
%a90%233.7.70.8:5000%a88%
%a89%СТС Мир%a88%
%a90%239.1.128.45:5000%a88%
%a89%ТВ3%a88%
%a90%233.7.70.220:5000%a88%
%a89%ТВ3%a88%
%a90%233.7.70.221:5000%a88%
%a89%ТВ3%a88%
%a90%239.1.128.43:5000%a88%
%a89%ТВЦ%a88%
%a90%233.7.70.5:5000%a88%
%a89%ТВЦ%a88%
%a90%233.7.70.219:5000%a88%
%a89%ТВЦ%a88%
%a90%239.1.128.42:5000%a88%
%a89%ТНТ%a88%
%a90%233.7.70.7:5000%a88%
%a89%ТНТ%a88%
%a90%233.7.70.21:5000%a88%
%a89%ТНТ%a88%
%a90%233.7.70.65:5000%a88%
%a89%ТНТ%a88%
%a90%239.1.128.44:5000%a88%
%a89%ТРО%a88%
%a90%233.7.70.143:5000%a88%
%a89%Усадьба%a88%
%a90%233.7.70.51:5000%a88%
%a89%Успех%a88%
%a90%233.7.70.34:5000%a88%
%a89%Феникс Плюс Кино%a88%
%a90%233.7.70.86:5000%a88%
%a89%Футбол%a88%
%a90%233.7.70.210:5000%a88%
%a89%Шансон ТВ%a88%
%a90%233.7.70.238:5000%a88%
%a89%Ю%a88%
%a90%233.7.70.92:5000%a88%
%a89%Ю%a88%
%a90%233.7.70.231:5000%a88%
%a89%Ю%a88%
%a90%239.1.128.47:5000%a88%
%a89%Юмор TV%a88%
%a90%233.7.70.46:5000%a88%

:a178
if "%a70%"=="0" goto a80
win_iconv.exe -f 1251 -t 65001 "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u">"%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u"
if exist "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u" del /q "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u"
move "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u" "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u">nul
set a117=1
if "%a113%"=="1" goto a114
set a117=0
if "%a201%"=="0" goto a80

:a247
set /a a248=%a248%+1
curl.exe -s -T "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a246) else (goto a80)

:a246
if "%a248%"=="2" goto a80
sleep.exe 10
goto a247

:a118
if exist "%a26%\%a87%" del /q "%a26%\%a87%"
rename "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u" "%a87%"
set a117=0
if "%a201%"=="0" goto a80

:a251
set /a a250=%a250%+1
curl.exe -s -T "%a26%\%a87%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a249) else (goto a80)

:a249
if "%a250%"=="2" goto a80
sleep.exe 10
goto a251

:a80
if "%a10%"=="0" goto a82
if exist "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u" del /q "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u"
move "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u" "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u">nul
set a119=1
if "%a113%"=="1" goto a114
set a119=0
if "%a201%"=="0" goto a83

:a254
set /a a253=%a253%+1
curl.exe -s -T "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a252) else (goto a83)

:a252
if "%a253%"=="2" goto a83
sleep.exe 10
goto a254

:a120
if exist "%a26%\%a86%" del /q "%a26%\%a86%"
rename "%a26%\%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u" "%a86%"
set a119=0
if "%a201%"=="0" goto a83

:a257
set /a a256=%a256%+1
curl.exe -s -T "%a26%\%a86%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a255) else (goto a83)

:a255
if "%a256%"=="2" goto a83
sleep.exe 10
goto a257

:a83
if "%a143%"=="0" goto a144
if "%a145%"=="1" goto a146
set /a a145=%a145%+1
if exist "%a26%\%a148%" del /q "%a26%\%a148%"
if exist "%a26%\%a147%" del /q "%a26%\%a147%"
if "%a113%"=="0" goto a149
set a148=%a147%

:a149
echo ^<table^>>"%a148%"
move "%a148%" "%a26%\%a148%">nul

:a146
if "%a369%"=="1" goto a426
if "%a97%"=="0" goto a189

:a426
if "%a183%"=="1" goto a188

:a189
if "%a10%%a70%"=="00" goto a162
if "%a113%"=="0" goto a151
if "%a10%"=="0" goto a154
set a150=%a86%
goto a152

:a162
set a150=%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%
goto a152

:a154
set a150=%a87%
goto a152

:a151
if "%a10%"=="0" goto a153
set a150=%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u
goto a152

:a153
set a150=%a27%%a79%%a28%%a79%%a1%%a79%%a2% (VLC).m3u
goto a152

:a188
if "%a113%"=="1" goto a192
set a150=%a27%%a79%%a28%%a79%%a1%%a79%%a2%.m3u
goto a152

:a192
set a150=%a187%

:a152
echo ^<tr^>^<td^>^<a href="http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/status"^>%a150%^</a^>^</td^>^<td^>^<img src="http://monitor.zone-game.info/check.php?do=status&ip=%a27%%a79%%a28%%a79%%a1%%a79%%a2%&port=%a43%&id=22"^>^</img^>^</td^>^</tr^>>>"%a26%\%a148%"
if "%a201%"=="0" goto a144

:a284
set /a a283=%a283%+1
curl.exe -s -T "%a26%\%a148%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a285) else (goto a144)

:a285
if "%a283%"=="2" goto a144
sleep.exe 10
goto a284

:a144
if "%a264%"=="1" (goto a265) else (goto a273)

:a273
if "%a4%"=="%a85%" (goto a199) else (goto a5)

:a265
if "%a123%"=="0" goto a273
if "%a193%"=="0" goto a273
set a266=0
set a270=-1
if "%a169%"=="1" title %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43% (%a4%)
echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% %a272%
if "%a163%"=="1" echo %a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%%a174%%a160%%a407%%a414%%a422% - сервер свободен (мониторинг сервера)>>"%a164%"
sleep.exe 10

:a269
set /a a266=%a266%+1
curl.exe -s -m 5 -o %a291% http://%a27%%a79%%a28%%a79%%a1%%a79%%a2%:%a43%/status
if exist "%a291%" (goto a267) else (goto a268)

:a267
set /a a270=%a270%+1
find "<td>%a270%</td>" %a291%>nul
if not errorlevel 1 goto a271
if "%a270%"=="%a319%" goto a274
goto a267

:a268
if "%a266%"=="2" goto a5
sleep.exe 10
goto a269

:a271
set a266=0
set a270=-1
if exist "%a291%" del /q %a291%
sleep.exe 10
goto a269

:a274
if exist "%a291%" del /q %a291%
goto a5

:a82
if exist "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u" del /q "%a27%%a79%%a28%%a79%%a1%%a79%%a2% (SimpleTV).m3u"
goto a83

:a72
set a161=1
goto a91

:a288
if "%a163%"=="1" echo Найдено серверов: ^%a4%>>"%a164%"
echo %a289% %a4%
goto a290

:a469
if "%a369%"=="1" goto a470
set a460=0
if exist "scanner.temp" del /q scanner.temp>nul 2>&1
if not exist "scanner.temp" goto a472
tasklist|find "vnc.exe"|find "%a93%">nul
if errorlevel 1 goto a472
tskill %a93%
sleep.exe 1

:a472
if exist "scanner.temp" del /q scanner.temp>nul 2>&1
if exist "scanner.temp" goto a475
if "%a476%"=="1" goto a473
goto a470

:a46
if "%a69%"=="0" goto a199
if "%a97%"=="0" goto a199
if "%a198%"=="0" goto a197
if "%a198%"=="1" goto a286
if "%a198%"=="2" goto a98

:a199
if "%a456%"=="1" goto a469

:a470
set a161=0
if "%a10%%a70%%a183%"=="000" goto a72

:a91
if "%a328%"=="0" goto a326
if "%a163%"=="1" echo.>>"%a164%"
echo.
set a328=0

:a326
if "%a143%"=="0" goto a321
if "%a4%"=="0" goto a321
if not exist "%a26%\%a148%" goto a321
echo ^</table^>>>"%a26%\%a148%"
set a323=0
if "%a201%"=="0" goto a321

:a324
set /a a323=%a323%+1
curl.exe -s -T "%a26%\%a148%" -u %a203%:%a204% %a205%
if errorlevel 1 (goto a322) else (goto a321)

:a322
if "%a323%"=="2" goto a321
sleep.exe 10
goto a324

:a391
if "%a163%"=="1" echo Проверено серверов: ^%a4%>>"%a164%"
echo %a394% %a4%
goto a395

:a390
if "%a161%"=="1" goto a391
if "%a163%"=="1" echo Создано плейлистов: ^%a4%>>"%a164%"
echo %a95% %a4%

:a395
if "%a163%"=="1" echo.>>"%a164%"
echo.
if "%a163%"=="1" echo Проверка завершена>>"%a164%"
echo %a392%
if "%a163%"=="1" echo.>>"%a164%"
echo.
goto a393

:a321
title %a3%
if "%a369%"=="1" goto a390
if "%a161%"=="1" goto a288
if "%a163%"=="1" echo Создано плейлистов: ^%a4%>>"%a164%"
echo %a95% %a4%

:a290
if "%a163%"=="1" echo.>>"%a164%"
echo.
if "%a163%"=="1" echo Сканирование завершено>>"%a164%"
echo %a47%
if "%a163%"=="1" echo.>>"%a164%"
echo.

:a393
if "%a209%"=="00:00" goto a211
set a155=0
set a212=0
set a213=0
set a214=0
set a215=0
set a222=0
set a312=0
set a145=0
set a477=0
sleep.exe 5

:a217
if "%a209%"=="%a212%%a213%:%a214%%a215%" goto a216
set /a a215=%a215%+1
if "%a215%"=="10" (goto a218) else (goto a217)

:a218
set a215=0
set /a a214=%a214%+1
if "%a214%"=="6" (goto a219) else (goto a217)

:a219
set a214=0
set a215=0
if "%a222%"=="1" goto a223
set /a a213=%a213%+1
if "%a213%"=="10" (goto a220) else (goto a217)

:a220
if "%a222%"=="1" goto a221
set a213=0
set /a a212=%a212%+1
if "%a212%"=="2" (goto a221) else (goto a217)

:a221
if "%a222%"=="1" goto a223
set a213=-1

:a223
set a222=1
set /a a213=%a213%+1
if "%a213%"=="4" (goto a224) else (goto a217)

:a224
if "%a209%"=="24:00" (goto a216) else (goto a211)

:a216
set /a a225=%a212%%a213%*60
set /a a225=%a225%+%a214%%a215%

:a235
cls
echo %a226% %a212%%a213%:%a214%%a215%
echo.
sleep.exe 60
set /a a225=%a225%-1
if "%a225%"=="0" goto a238

set /a a215=%a215%-1
if "%a215%"=="-1" (goto a227) else (goto a235)

:a227
set a215=9
set /a a214=%a214%-1
if "%a214%"=="-1" (goto a236) else (goto a235)

:a236
set a214=5
set /a a213=%a213%-1
if "%a213%"=="-1" (goto a237) else (goto a235)

:a237
if "%a212%"=="0" goto a238
set a213=9
set /a a212=%a212%-1
goto a235

:a238
cls
echo %a226% 00:00
echo.
sleep.exe 2
cls
goto a232

:a211
if "%a121%"=="1" goto a122
pause>nul
cls
sleep.exe 1
exit

:a122
sleep.exe 5
cls
sleep.exe 1
exit

:a104
cls
echo %a105%
echo.
pause>nul
cls
sleep.exe 1
exit

:a78
set a439=0
set a313=%b1%
set a314=%b2%
set a315=%b3%
goto a438

:a98
set /a a439=%a439%+1
if not "%a439%"=="1" goto a440
set a315=%b4%
goto a286

:a440
if not "%a439%"=="2" goto a441
set a315=%b5%
goto a286

:a441
if not "%a439%"=="3" goto a442
set a315=%b6%
goto a286

:a442
if not "%a439%"=="4" goto a443
set a315=%b7%
goto a286

:a443
if not "%a439%"=="5" goto a444
set a315=%b8%
goto a286

:a444
if not "%a439%"=="6" goto a445
set a315=%b9%
goto a286

:a445
if not "%a439%"=="7" goto a446
set a315=%b10%
goto a286

:a446
if not "%a439%"=="8" goto a447
set a315=%b11%
goto a286

:a447
if not "%a439%"=="9" goto a448
set a315=%b12%
goto a286

:a448
if not "%a439%"=="10" goto a449
set a315=%b13%
goto a286

:a449
if not "%a439%"=="11" goto a450
set a315=%b14%
goto a286

:a450
if not "%a439%"=="12" goto a451
set a315=%b15%
goto a286

:a451
if not "%a439%"=="13" goto a452
set a315=%b16%
goto a286

:a452
if not "%a439%"=="14" goto a453
set a315=%b17%
goto a286

:a453
if not "%a439%"=="15" goto a454
set a315=%b18%
goto a286

:a454
if not "%a439%"=="16" goto a455
set a315=%b19%
goto a286

:a455
if not "%a439%"=="17" goto a199
set a315=%b20%
goto a286

:a438
set a198=0
if "%a313%"=="" goto a196
set a313=%a313: =%
for /f "delims=. tokens=1" %%a in ("%a313%") do set a27=%%a
for /f "delims=. tokens=2" %%a in ("%a313%") do set a28=%%a
for /f "delims=. tokens=3" %%a in ("%a313%") do set a1=%%a
for /f "delims=.- tokens=4" %%a in ("%a313%") do set a2=%%a
for /f "delims=.- tokens=7" %%a in ("%a313%") do set a44=%%a
for /f "delims=.-: tokens=8" %%a in ("%a313%") do set a73=%%a
for /f "delims=: tokens=2" %%a in ("%a313%") do set a43=%%a
goto a196

:a197
set a155=0
set a198=1
if "%a314%"=="" goto a196
set a314=%a314: =%
for /f "delims=. tokens=1" %%a in ("%a314%") do set a27=%%a
for /f "delims=. tokens=2" %%a in ("%a314%") do set a28=%%a
for /f "delims=. tokens=3" %%a in ("%a314%") do set a1=%%a
for /f "delims=.- tokens=4" %%a in ("%a314%") do set a2=%%a
for /f "delims=.- tokens=7" %%a in ("%a314%") do set a44=%%a
for /f "delims=.-: tokens=8" %%a in ("%a314%") do set a73=%%a
for /f "delims=: tokens=2" %%a in ("%a314%") do set a43=%%a
goto a196

:a286
set a155=0
set a198=2
if "%a315%"=="" goto a196
set a315=%a315: =%
for /f "delims=. tokens=1" %%a in ("%a315%") do set a27=%%a
for /f "delims=. tokens=2" %%a in ("%a315%") do set a28=%%a
for /f "delims=. tokens=3" %%a in ("%a315%") do set a1=%%a
for /f "delims=.- tokens=4" %%a in ("%a315%") do set a2=%%a
for /f "delims=.- tokens=7" %%a in ("%a315%") do set a44=%%a
for /f "delims=.-: tokens=8" %%a in ("%a315%") do set a73=%%a
for /f "delims=: tokens=2" %%a in ("%a315%") do set a43=%%a

:a196
if not "%a198%"=="0" goto a200
set a76=%a27%.%a28%.%a1%.%a2% - %a27%.%a28%.%a44%.%a73%
if "%a313%"=="" (goto a77) else (goto a110)

:a200
if not "%a198%"=="1" goto a287
set a76=%a27%.%a28%.%a1%.%a2% - %a27%.%a28%.%a44%.%a73%
if "%a314%"=="" (goto a199) else (goto a110)

:a287
if not "%a198%"=="2" goto a199
set a76=%a27%.%a28%.%a1%.%a2% - %a27%.%a28%.%a44%.%a73%
if "%a315%"=="" (goto a199) else (goto a110)

:a110
if "%a183%"=="0" goto a186
if "%a175%"=="" goto a329
if not exist "%a175%" goto a184
if "%a176%"=="" goto a330
if "%a339%"=="0" goto a186
if not "%a340%"=="0" goto a186
set /a a340=%a340%+1
if exist "scanner.temp" del /q scanner.temp
copy %a175% scanner.temp>nul
set a175=scanner.temp

:a186
set a45=256
set /a a44=%a44%+1
set /a a2=%a2%-1
set /a a73=%a73%+1
set /a a74=%a44%-1
if "%a198%"=="0" (goto a84) else (goto a275)

:a275
if "%a328%"=="0" goto a325
echo.
if "%a163%"=="1" echo.>>"%a164%"
set a328=0

:a325
echo %a8% %a76% :%a43%
if "%a163%"=="1" echo Сканируется диапазон IP-адресов %a76% :%a43%>>"%a164%"
echo.
if "%a163%"=="1" echo.>>"%a164%"
goto a5

:a329
echo %a327%
echo.
pause>nul
cls
sleep.exe 1
exit

:a184
echo %a185% "%a175%"
echo.
pause>nul
cls
sleep.exe 1
exit

:a330
echo %a331%
echo.
pause>nul
cls
sleep.exe 1
exit

:a77
echo %a75%
echo.
pause>nul
cls
sleep.exe 1
exit

:a333
echo %a334%
echo.
pause>nul
cls
sleep.exe 1
exit

:a336
echo %a337%
echo.
pause>nul
cls
sleep.exe 1
exit

:a374
echo %a375%
echo.
pause>nul
cls
sleep.exe 1
exit

:a376
echo %a377% "%a370%"
echo.
pause>nul
cls
sleep.exe 1
exit

:a465
cls
echo %a474%
echo.
pause>nul
cls
sleep.exe 1
exit

:a475
cls
echo %a228%
echo.
pause>nul
cls
sleep.exe 1
exit

rem a488

exit
